print("Бондурянський Кирило Юрійович \nЛабораторна робота №1 \nВаріант 1 \nДруге завдання \nЗнайдення відповідного значення функції залежно від введеного числа")
x = float(input("Введіть перше число: "))
y = float(input("Введіть друге число: "))
z = float(input("Введіть третє число: "))
if x >= 0:
    print("Перше число більше або рівне 0, тому маємо " + str(x**2))
else: print("Перше число менше за 0, тому маємо " + str(x**4))
if y >= 0:
    print("Друге число більше за 0, тому маємо " + str(y**2))
else: print("Друге число менше за 0, тому маємо " + str(y**4))
if z >= 0:
    print("Третє число більше за 0, тому маємо " + str(z**2))
else: print("Третє число менше за 0, тому маємо " + str(z**4))
                                
